<template>
    <div>
        滚动位置：<InputNumber :min="0" :max="1000000" v-model="to" />
        滚动时间：<InputNumber :min="0" :max="1000000" v-model="time" />
        <Button @click="handleScroll">滚动</Button>
        <div class="demo-scroll-top" ref="scroll">
            <h1>“第二十四章 Think Different 非同凡想”</h1>
            <p>“李·克劳是Chiat\Day广告公司的创意总监，正是他为麦金塔电脑的上市打造了震撼的广告片——“1984”。1997年7月初的一天，他正驾车行驶于洛杉矶，这时车载电话响了，是乔布斯打来的。“嗨，李，我是史蒂夫，”乔布斯说，“你猜怎么着？阿梅里奥刚刚辞职了。你能过来一趟吗？”</p>
            <p>“苹果当时正在挑选新的广告代理商，而乔布斯还没有看到满意的。所以他希望克劳和他的公司（当时已经改名为TBWA\Chiat\Day)来参与竞争。“我们必须证明苹果仍然生机勃勃，”乔布斯说，“而且它仍然代表着与众不同。”</p>
            <p>“克劳说他不参与广告比稿。“你知道我们的水平广他说。然而乔布斯开始恳求，他说很难拒绝其他参与比稿的广告代理——包括BBDO和阿诺国际传播(Arnold Worldwide)——而直接起用“老关系”。克劳于是同意带一些创意脚本飞到库比蒂诺。回忆当年的那一幕，乔布斯潸然泪下：”</p>
            <p>“想到这件事就会让我哽咽，真的让我哽咽。显然，李还是那么爱苹果。他不愧是最棒的广告人。当时他已经10年没有比过稿了。可他来了，他把他的心都掏了出来，因为他和我们一样爱苹果。是他和他的团队带来了这个无与伦比的创意——“非同凡想”，比其他人的要好上10倍。我激动得说不出话来，现在一想到这个我还是忍不住流泪：李那么在乎苹果，还有他那个棒极了的“非同凡想”。每当我发现自己身处一种纯粹种精神与爱的纯粹之中，我就会忍不住掉眼泪。这感觉就这么撞进了我的心，一下子抓住了我。当时就是这样。那种纯粹我永远都不会忘记。他坐在我的办公室里给我看那些创意，我就忍不住哭了。每次一想到这个我还是忍不住要哭。”</p>
            <p>“乔布斯和克劳一致认为苹果是世界上最伟大的品牌之一——如果加上感情因　素可能排进前五名——但是需要让大家意识到它的与众不同之处。所以他们想要一个品牌形象宣传，而不是一系列突出产品的广告。其创意目的并不是赞美计算机可以做什么，而是赞美富有创造力的人们在计算机的辅助下可以做什么。“这不是在说处理器速度或者内存，”乔布斯回忆说，“而是在说创造力。”它的目标受众不仅仅是潜在的顾客，还包括苹果自己的员工。“我们苹果的员工已经忘记了自己是谁。要回想起你是谁的方法之一，就是要想起你的偶像是谁。这就是那次宣传活动的缘起。”</p>
            <p>“克劳和他的团队尝试了很多种方式去赞美那些“非同凡想”的“狂人”。他们用席尔(Seal)的歌曲《疯狂》（“若不疯狂，便会灭亡……”）做了一段视频，但是没能拿到这首歌的版权。之后他们又尝试了各种版本，用过美国诗人罗伯特·弗罗斯特(Robert Frost)朗诵《未选择的路》(The Road Not Taken)的录音，也用过罗宾·威廉姆斯(Robin Williams)在《死亡诗社》(Dead Poet Society)中的演讲录音。最终他们决定，需要撰写原创的广告词，于是他们开始写初稿，开头就是：“致疯狂的人……”</p>
            <p>“乔布斯一如既往地要求严格。当克劳的团队飞过去给他看一个版本的广告词时，乔布斯冲着年轻的广告撰稿人爆发了。“这是狗屎！”他咆哮着，“这是广告公司制造出来的垃圾，我恨它！”这是那位年轻的撰稿人第一次见乔布斯，他站在那儿哑口无言。后来他再也没有回去。但是那些能勇敢面对乔布斯的人——包括克劳和他的同事肯·西格尔(Ken Segall)以及克雷格·谷本(Craig Tanimoto)——成功地跟他一起创作了一段朗朗上口的广告词。在最初的60秒版本中，它是这样的：”</p>
            <p>“致疯狂的人。他们特立独行。他们桀骜不驯。他们惹是生非。他们格格不入。他们用与众不同的眼光看待事物。他们不喜欢墨宁成规。他们也不愿安于现状。你可以认同他们，反对他们，颂扬或是诋毁他们。但唯独不能漠视他们。因为他们改变了寻常事物。他们推动人类向前迈进。或许他们是别人眼里的疯子，但他们却是我们眼中的天才。因为只有那些疯狂到以为自己能够改变世界的人……才能真正改变世界。”</p>
            <p>“其中几句是乔布斯亲自撰写的，包括“他们推动人类向前迈进”那一句。到8月初Macworld大会在波士顿召开时，他们已经有了一个初步的版本，他向自己的团队进行了展示。他们都认为它还不够完善，但乔布斯在他的主题演讲中用上了这些概念以及“非同凡想”这个短语。“一个绝妙的理念正在萌芽，”他说，“苹果品牌代表的，是那些跳出固有模式进行思考的人，那些想用计算机帮助自己改变世界的人。”</p>
            <p>“他们争论了语法问题：如果“非同”(different)是修饰动词“想”(think)，那应该以副词的形式出现，即“想得不同”(think differently)。但是乔布斯坚持说他想要把“非同”当成名词来用，就像“think victory”（思考胜利）或“think beauty”(思考美丽）里的用法一样。同时，这也体现了一种口语用法，诸如“think big”(野心勃勃）这类短语。乔布斯后来解释说：“我们在推出它之前讨论了它的正确性。如果你想想我们要表达的意思，就知道它是合乎语法的。不是想‘同样的事’，而是想‘不同的事’。想一点不同的事，想很多不同的事，非同凡想。而‘想得不同’就表达不出我想要的意思。”</p>
            <p>“为了让人们联想到《死亡诗社》的精神，克劳和乔布斯想让罗宾·威廉姆斯朗读这段旁白。威廉姆斯的经纪人说他不做广告，于是乔布斯尝试直接给他打电话。他联系上了威廉姆斯的妻子，但她不让他直接和威廉姆斯通话，因为她知道乔布斯多么擅长说服别人。他们还考虑了玛雅·安吉洛(Maya Angelou)和汤姆·汉克斯。那年秋天，在一场比尔·克林顿出席的筹款晚宴上，乔布斯把总统拉到一边，请求他打电话给汉克斯，说服汉克斯来做这件事，但是总统“搁置否决”了这个请求。最终他们选定了理查德·德莱福斯(Richard Dreyfuss)，他是位忠实的苹果迷。”</p>
            <p>“除了电视广告，他们还创造了历史上最令人难忘的一系列平面广告。每则广告都有一个标志性历史人物的黑白肖像，除此之外只有角落里的苹果标志和广告语“非同凡想”。更酷的是，这些肖像都没有说明文字。其中有些人——爱因斯坦、甘地、列侬、迪伦、毕加索、爱迪生、卓别林、马丁·路德·金——很容易辨认。但是另一些就不那么容易叫出名字，需要加以猜测或询问别人那是谁：玛莎·葛莱姆(Martha Graham)、安塞尔·亚当斯、理查德.费曼(Richard Feynman)、玛利亚·卡拉斯(Maria Callas)、弗兰克·劳埃德·赖特、詹姆斯·沃森(James Watson)、阿梅莉亚·埃尔哈特(Amelia Earhart)。”</p>
            <p>“这些人大多是乔布斯心目中的偶像。他们都富有创造性，敢于冒险，不惧失败，赌上自己的职业生涯去做与众不同的事情。作为一个摄影迷，乔布斯亲自参与照片选择，确保为偶像们选到完美的肖像。“这张甘地的照片不对劲儿。”有一次他对克劳发火。克劳解释说，那张由摄影师玛格丽特·伯克-怀特(Margaret Bourke-White)拍摄的甘地在纺车边的著名照片，肖像版权由时代与生活图片社所有，不能被用于商业用途。于是，乔布斯给时代公司的主编诺曼·珀尔斯坦(Norman Pearlstine)打电话，软磨硬泡地让他破了一次例。他打电话给尤妮斯·施赖弗(Eunice Shriver)，确认她的家族同意公开一张她哥哥鲍比·肯尼迪(Bobby Kennedy)在阿巴拉契亚山间旅行的照片，他很喜欢那一张；他还亲自跟吉姆·汉森(Jim Henson)的孩子们沟通，拿到了这位已故提线木偶剧演员的最合适的照片。”</p>
            <p>“他同样给小野洋子打电话要一张她已故丈夫约翰·列侬的照片。她给他寄了一张，但那不是乔布斯最喜欢的。“在广告投放之前，我在纽约，去了一家我喜欢的日本小餐馆，并告诉她我会在那II。”他回忆说。当他到达时，小野洋子来到他面前。“这张好一些，”她说着，递给他一个信封。“我想我会见到你，所以我就随身带着这个。”这就是那张她和约翰拿着花束一起在床上的经典照片。苹果最终使用了这张照片。“我能看出来约翰为什么会爱上她。”乔布斯回忆说。”</p>
            <p>“理査德·德莱福斯读的旁白效果很好。但是李·克劳有了另一个想法。如果乔布斯自己读这段画外音会怎么样？“你得明白，”克劳对他说，“你应该这样做。”于是，乔布斯坐进录音室，试录了几次，很快就完成了一条录音，大家都很喜欢。当时的想法是，如果用它，他们不会告诉大家是谁在说这些话，就像他们不给偶像们的肖像配说明文字一样。最终人们会猜出那是乔布斯。“使用你的声音，效果会非常强烈，”克劳说，“这是一种表明你再次拥有这个品牌的方式。”</p>
            <p>“乔布斯无法决定用自己的声音还是仍然用德莱福斯的版本。最后，到了广告必须提交给电视台的那晚，它将在《玩具总动员》的电视首映式上播出，这是个合适的时机。一如既往，乔布斯不喜欢被强迫作出决定。最后，他告诉克劳两个版本都发出去，这样他就可以思考到早上再决定。到了早上，乔布斯打电话告诉他们用德莱福斯的版本。“如果用我的声音，人们发现后会觉得那是关于我的广告。”他告诉克劳，“可那不是。那是关于苹果的。”</p>
            <p>“自从参加了苹果农场之后，乔布斯就把自己定义为一个反主流文化的孩子，这个定义也延伸到了苹果公司。在“非同凡想”和“1984”等广告中，他利用对苹果品牌的定位重申了自己的叛逆性格，尽管当时他已经是一个亿万富翁了，这也让“婴儿潮”一代的其他人和他们的孩子纷纷效仿。“从他年轻时我第一次见到他，他就有无比强烈的直觉，知道他想让他的品牌对人们产生什么样的影响克劳说。”</p>
            <p>“极少有其他公司或领导者——可能根本没有——敢于把他们的品牌跟甘地、爱因斯坦、马丁·路德·金、毕加索联系在一起，而且大获成功。乔布斯能够鼓励人们定义自己——作为反企业的、富有创造性的、敢于创新的叛逆者——而且只通过使用什么电脑就实现了这种定义。“史蒂夫创造了科技行业唯一一个时尚品牌，”拉里·埃利森说，“人们会因为拥有某些品牌的汽车而骄傲——保时捷、法拉利、普锐斯——因为我开什么车能一定程度上说明我是什么样的人。人们对苹果的产品有同样的感受。”</p>
            <p>“从“非同凡想”宣传活动开始，乔布斯会在每周三下午跟他的主要代理商、营销部门和公关部门开三个小时的自由讨论会，探讨广告战略，这个惯例在乔布斯在苹果公司的岁月里一直延续了下去。“地球上再没有哪个CEO像史蒂夫一样对待市场营销。”克劳说，“每周三他都在审定新的电视广告、平面广告和广告牌。”会议结束后，乔布斯常常带克劳和克劳的两个同事——邓肯·米尔纳(Duncan Milner)和詹姆斯·文森特(James Vincent)——一起去苹果戒备森严的设计工作室看开发中的产品。“当他向我们展示正在开发的东西时，会变得激情澎湃。”文森特说。乔布斯在产品创造过程中就和营销专家们分享他的激情，可以确保他们制作的每一个广告中都灌输了他的情感。”</p>
            <p>摘录来自: [美] 沃尔特·艾萨克森. “史蒂夫·乔布斯传。”</p>
        </div>
    </div>
</template>
<script>
export default {
    data () {
        return {
            to: 200,
            time: 1000
        }
    },
    methods: {
        handleScroll () {
            this.$ScrollTop(this.$refs.scroll, {
                to: this.to,
                time: this.time
            })
        }
    }
}
</script>
<style>
.demo-scroll-top{
    height: 400px;
    overflow: auto;
    border: 1px solid #999;
}
.demo-scroll-top p{
    padding: 12px;
}
</style>
